app/controllers/registrations_controller.rb

  def update_resource(resource, params)
    resource.update_without_password(user_params)
---
UPDATE "users" SET "updated_at" = ?, "company" = ? WHERE "users"."id" = ?  [["updated_at", "2022-12-19 04:46:59.421696"], ["company", "MFV HCMx"], ["id", 6]]