app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])
    if @user.update(user_params_update)
---
UPDATE "users" SET "encrypted_password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["encrypted_password", "$2a$12$O0D.sdpt/6MNrqLbVGkwSOBulS0W2VhJy7pRgyuJvdt1yLo2eX1fm"], ["updated_at", "2022-12-19 07:00:43.721130"], ["id", 6]]

  def update_password
    @user = current_user
    if @user.update_with_password(user_params)
---
UPDATE "users" SET "encrypted_password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["encrypted_password", "$2a$12$O0D.sdpt/6MNrqLbVGkwSOBulS0W2VhJy7pRgyuJvdt1yLo2eX1fm"], ["updated_at", "2022-12-19 07:00:43.721130"], ["id", 6]]